// pages/board/board.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    news: [{
      title: '新闻中心',
      content: '国家自然科学、技术发明一等奖多次空缺，表明我国基础研究曾不同程度地存在着科技投入不足、实验设备落后、优秀人才流失、学术环境恶化等问题。围绕走中国特色的自主创新，努力建设创新型国家这一主题，我国科技创新能力不断提高，科技发展已进入重要跃升期。',
      pic: '/images/board/xinwen.jpg',
      file: '关于春节放假通告.pdf'
    }, {
        title: '技术实力',
        content: '创新就是点点滴滴的从很多细微之处去改进，绝大多数的员工都不会刻意的去想如何创新，但会尽力的将自己的工作做的有新意，因为他们都希望得到上级的肯定。所以可以从这个角度来思考，想一些办法。另外创新之所以不常发生，一方面是因为人的惰性，另一方面也是因为天赋不足，所以激励创新这事儿没有必要铺开了做，而是要先抓住那些积极并且有天赋的员工，在逐步带动其他的人。',
        pic: '/images/board/jishu.jpg',
        file: ''
    }, {
        title: '人力资源',
        content: '您受雇后须严格遵守公司的信息保密要求，在任何时候任何场合不得向第三方泄露公司的客户资料、公司各项经营数据和财务信息。同时，在离开公司一年内不允许到本地同品牌的其他公司任职。另外，员工的薪酬属于公司信息，员工不能向其它员工透露自己的薪酬，也不能相互讨论；公司各项经营数据和财务信息，未经上级部门同意，员工不能越级探知。',
        pic: '/images/board/hr.jpg',
        file: '最新招聘信息公告.pdf'
    }, {
        title: '行业动态',
        content: '环保税对企业的影响究竟有多大？据记者了解，目前除西藏自治区外，各省（区、市）均已出台了本地区应税大气污染物和水污染物的具体适用税额。其中，黑龙江、福建、新疆等12个省份按低限确定税额，其大气、水污染物税额分别为每污染当量1.2元和1.4元。内蒙古、海南、云南等12个省份税额处于中间水平，其大气污染物税额在每污染当量1.8元至3.9元之间，水污染物税额在每污染当量2.1元至3.5元之间。北京、天津、河北等6个省（市）税额处于较高水平，其大气污染物税额在每污染当量4.8元至12元之间，水污染物税额在每污染当量4.8元至14元之间。',
        pic: '/images/board/dongtai.jpg',
        file: ''
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})